// Задайте массив на 10 целых чисел.
// Напишите программу, которая определяет
// количество чётных чисел в массиве.

// массив [6 7 19 34 3 1 4 7 9 1] => 3
// массив [1 8 43 4 55 60 3 2 1 3] => 4

int[] arr = { 6, 7, 19, 34, 3, 1, 4, 7, 9, 1 };
// int[] arr = { 1, 8, 43, 4, 55, 60, 3, 2, 1, 3 };
int counter = 0;
int i = 0;

while (i < arr.Length)
{
    if (arr[i] % 2 == 0)
    {
        counter += 1;
        i++;
    }
    else
    {
        i++;
    }
}
Console.Write(counter);